atsamd-rs/atsamd/svd/ATSAMD20J18A.svd
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XOSCRDY</name>
              <description>XOSC Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XOSC32KRDY</name>
              <description>XOSC32K Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSC32KRDY</name>
              <description>OSC32K Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSC8MRDY</name>
              <description>OSC8M Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLRDY</name>
              <description>DFLL Ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLOOB</name>
              <description>DFLL Out Of Bounds</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLLCKF</name>
              <description>DFLL Lock Fine</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLLCKC</name>
              <description>DFLL Lock Coarse</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLLRCS</name>
              <description>DFLL Reference Clock Stopped</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD33RDY</name>
              <description>BOD33 Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B33SRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKSR</name>
          <description>Power and Clocks Status</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>XOSCRDY</name>
              <description>XOSC Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC32KRDY</name>
              <description>XOSC32K Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC32KRDY</name>
              <description>OSC32K Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC8MRDY</name>
              <description>OSC8M Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFLLRDY</name>
              <description>DFLL Ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFLLOOB</name>
              <description>DFLL Out Of Bounds</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFLLLCKF</name>
              <description>DFLL Lock Fine</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFLLLCKC</name>
              <description>DFLL Lock Coarse</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFLLRCS</name>
              <description>DFLL Reference Clock Stopped</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33RDY</name>
              <description>BOD33 Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>B33SRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC</name>
          <description>XOSC Control</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <resetValue>0x0080</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XTALEN</name>
              <description>Crystal Oscillator Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>Enable on Demand</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAIN</name>
              <description>Gain Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AMPGC</name>
              <description>Automatic Amplitude Gain Control</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Start-Up Time</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32K</name>
          <description>XOSC32K Control</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <resetValue>0x0080</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XTALEN</name>
              <description>Crystal Oscillator Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN32K</name>
              <description>32kHz Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>1kHz Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AAMPEN</name>
              <description>Automatic Amplitude Control Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>Enable on Demand</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Start-Up Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WRTLOCK</name>
              <description>Write Lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32K</name>
          <description>OSC32K Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x003F0080</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN32K</name>
              <description>32kHz Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>1kHz Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>Enable on Demand</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Start-Up Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WRTLOCK</name>
              <description>Write Lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALIB</name>
              <description>Calibration Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCULP32K</name>
          <description>OSCULP32K Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <resetValue>0x0F</resetValue>
          <fields>
            <field>
              <name>CALIB</name>
              <description>Calibration Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>WRTLOCK</name>
              <description>Write Lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC8M</name>
          <description>OSC8M Control A</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x87070382</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>Enable on Demand</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESC</name>
              <description>Prescaler Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CALIB</name>
              <description>Calibration Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>FRANGE</name>
              <description>Frequency Range</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLCTRL</name>
          <description>DFLL Config</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <resetValue>0x0080</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STABLE</name>
              <description>Stable Frequency</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LLAW</name>
              <description>Lose Lock After Wake</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>Enable on Demand</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCDIS</name>
              <description>Chill Cycle Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QLDIS</name>
              <description>Quick Lock Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLVAL</name>
          <description>DFLL Calibration Value</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine Calibration Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse Calibration Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIFF</name>
              <description>Multiplication Ratio Difference</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLMUL</name>
          <description>DFLL Multiplier</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUL</name>
              <description>Multiplication Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FSTEP</name>
              <description>Maximum Fine Step Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CSTEP</name>
              <description>Maximum Coarse Step Size</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLSYNC</name>
          <description>DFLL Synchronization</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>READREQ</name>
              <description>Read Request Synchronization</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD33</name>
          <description>3.3V Brown-Out Detector (BOD33) Control</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>Hysteresis Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTION</name>
              <description>Action when Threshold Crossed</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operation Modes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEN</name>
              <description>Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSEL</name>
              <description>Prescaler Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>LEVEL</name>
              <description>Threshold Level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VREG</name>
          <description>VREG Control</description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <resetValue>0x0402</resetValue>
          <fields>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCELDO</name>
              <description>Force LDO Voltage Regulator</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VREF</name>
          <description>VREF Control A</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSEN</name>
              <description>Temperature Sensor Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BGOUTEN</name>
              <description>Bandgap Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALIB</name>
              <description>Voltage Reference Calibration Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
